### The goals is to predict the income class based on the independent variables
* Target variable: income

In [10]:
## Import libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline 
import warnings
warnings.filterwarnings('ignore')

pd.set_option('display.max_columns', None)

In [19]:
## import data

df= pd.read_csv(r'C:\Users\timothe\Documents\Documents\Python\Udemy\Model_Deployment\adults.csv')

In [20]:
print(df.shape)
df.head()

(32561, 15)

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              32561 non-null  int64
 1   workclass        32561 non-null  object
 2   fnlwgt           32561 non-null  int64
 3   education        32561 non-null  object
 4   educational-num  32561 non-null  int64
 5   marital-status   32561 non-null  object
 6   occupation       32561 non-null  object
 7   relationship     32561 non-null  object
 8   race             32561 non-null  object
 9   gender           32561 non-null  object
 10  capital-gain     32561 non-null  int64
 11  capital-loss     32561 non-null  int64
 12  hours-per-week   32561 non-null  int64
 13  native-country   32561 non-null  object
 14  income           32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

### Dropping fnlwgt and educational-num
* educational-num and educational are the same

In [28]:
df.drop(['educational-num','fnlwgt'], axis=1, inplace=True)

In [ ]:
### Verification

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   education       32561 non-null  object
 3   marital-status  32561 non-null  object
 4   occupation      32561 non-null  object
 5   relationship    32561 non-null  object
 6   race            32561 non-null  object
 7   gender          32561 non-null  object
 8   capital-gain    32561 non-null  int64
 9   capital-loss    32561 non-null  int64
 10  hours-per-week  32561 non-null  int64
 11  native-country  32561 non-null  object
 12  income          32561 non-null  object
dtypes: int64(4), object(9)
memory usage: 3.2+ MB

In [119]:
df.isnull().sum()

age               0
workclass         0
education         0
marital-status    0
occupation        0
relationship      0
race              0
gender            0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

#### No missing values

In [30]:
df.describe()

                age  capital-gain  capital-loss  hours-per-week
count  32561.000000  32561.000000  32561.000000    32561.000000
mean      38.581647   1077.648844     87.303830       40.437456
std       13.640433   7385.292085    402.960219       12.347429
min       17.000000      0.000000      0.000000        1.000000
25%       28.000000      0.000000      0.000000       40.000000
50%       37.000000      0.000000      0.000000       40.000000
75%       48.000000      0.000000      0.000000       45.000000
max       90.000000  99999.000000   4356.000000       99.000000

### Numerical columns

In [31]:
col_num= df.select_dtypes(exclude='object').columns

col_num

Index(['age', 'capital-gain', 'capital-loss', 'hours-per-week'], dtype='object')

In [41]:
##Find min and max

for i , name in enumerate(col_num):
    print(f'{name}: {df[name].min()} - {df[name].max()}')

age: 17 - 90
capital-gain: 0 - 99999
capital-loss: 0 - 4356
hours-per-week: 1 - 99

### Categorical coluns

In [42]:
col_cat= df.select_dtypes(include='object').columns

col_cat

Index(['workclass', 'education', 'marital-status', 'occupation',
       'relationship', 'race', 'gender', 'native-country', 'income'],
      dtype='object')

In [48]:
## Find unique option

for i, name in enumerate(col_cat):
    print(f'{name}: \n {df[name].unique()} \n ')

workclass:
 [' State-gov' ' Self-emp-not-inc' ' Private' ' Federal-gov' ' Local-gov'
 ' ?' ' Self-emp-inc' ' Without-pay' ' Never-worked']

education:
 [' Bachelors' ' HS-grad' ' 11th' ' Masters' ' 9th' ' Some-college'
 ' Assoc-acdm' ' Assoc-voc' ' 7th-8th' ' Doctorate' ' Prof-school'
 ' 5th-6th' ' 10th' ' 1st-4th' ' Preschool' ' 12th']

marital-status:
 [' Never-married' ' Married-civ-spouse' ' Divorced'
 ' Married-spouse-absent' ' Separated' ' Married-AF-spouse' ' Widowed']

occupation:
 [' Adm-clerical' ' Exec-managerial' ' Handlers-cleaners' ' Prof-specialty'
 ' Other-service' ' Sales' ' Craft-repair' ' Transport-moving'
 ' Farming-fishing' ' Machine-op-inspct' ' Tech-support' ' ?'
 ' Protective-serv' ' Armed-Forces' ' Priv-house-serv']

relationship:
 [' Not-in-family' ' Husband' ' Wife' ' Own-child' ' Unmarried'
 ' Other-relative']

race:
 [' White' ' Black' ' Asian-Pac-Islander' ' Amer-Indian-Eskimo' ' Other']

gender:
 [' Male' ' Female']

native-country:
 [' United-States' ' Cuba' ' Jamaica' ' India' ' ?' ' Mexico' ' South'
 ' Puerto-Rico' ' Honduras' ' England' ' Canada' ' Germany' ' Iran'
 ' Philippines' ' Italy' ' Poland' ' Columbia' ' Cambodia' ' Thailand'
 ' Ecuador' ' Laos' ' Taiwan' ' Haiti' ' Portugal' ' Dominican-Republic'
 ' El-Salvador' ' France' ' Guatemala' ' China' ' Japan' ' Yugoslavia'
 ' Peru' ' Outlying-US(Guam-USVI-etc)' ' Scotland' ' Trinadad&Tobago'
 ' Greece' ' Nicaragua' ' Vietnam' ' Hong' ' Ireland' ' Hungary'
 ' Holand-Netherlands']

income:
 [' <=50K' ' >50K']

In [47]:
for i, name in enumerate(col_cat):
    print(f'{name}: \n {df[name].value_counts(dropna=False)} \n ')

workclass:
  Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: workclass, dtype: int64

education:
  HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name: education, dtype: int64

marital-status:
  Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: marital-status, dtype: int64

occupation:
  Prof-specialty       4140
 Craft-repair         4099
 Exec-managerial      4066
 Adm-clerical         3770
 Sales                3650
 Other-service        3295
 Machine-op-inspct    2002
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1370
 Farming-fishing       994
 Tech-support          928
 Protective-serv       649
 Priv-house-serv       149
 Armed-Forces            9
Name: occupation, dtype: int64

relationship:
  Husband           13193
 Not-in-family      8305
 Own-child          5068
 Unmarried          3446
 Wife               1568
 Other-relative      981
Name: relationship, dtype: int64

race:
  White                 27816
 Black                  3124
 Asian-Pac-Islander     1039
 Amer-Indian-Eskimo      311
 Other                   271
Name: race, dtype: int64

gender:
  Male      21790
 Female    10771
Name: gender, dtype: int64

native-country:
  United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: native-country, dtype: int64

income:
  <=50K    24720
 >50K      7841
Name: income, dtype: int64

#### Decretization: making categorical data more meaningful.
* Apply on marital-status

In [50]:
df['marital-status'].unique()

array([' Never-married', ' Married-civ-spouse', ' Divorced',
       ' Married-spouse-absent', ' Separated', ' Married-AF-spouse',
       ' Widowed'], dtype=object)

In [59]:
df['marital-status'] = df['marital-status'].replace([' Divorced', ' Married-AF-spouse',  
              ' Married-civ-spouse', ' Married-spouse-absent',  
              ' Never-married', ' Separated', ' Widowed'], 
             ['divorced', 'married', 'married', 'married', 
              'not married', 'not married', 'not married']
          )

In [60]:
## Verification

df['marital-status'].unique()

array(['not married', 'married', 'divorced'], dtype=object)

* Label encoding

In [78]:
df.head()

,age,workclass,education,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,Bachelors,not married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,Bachelors,married,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,HS-grad,divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,11th,married,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,Bachelors,married,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [62]:
col_cat

Index(['workclass', 'education', 'marital-status', 'occupation',
       'relationship', 'race', 'gender', 'native-country', 'income'],
      dtype='object')

In [81]:
## Converting to continuous
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder

#Instanciate
encoder=LabelEncoder()

## Specify columns
df[['workclass', 'education', 'marital-status', 'occupation',
       'relationship', 'race', 'gender', 'native-country', 'income']] = df[['workclass', 'education', 'marital-status', 'occupation',
       'relationship', 'race', 'gender', 'native-country', 'income']].apply(LabelEncoder().fit_transform)

In [82]:
df.head()

,age,workclass,education,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,7,9,2,1,1,4,1,2174,0,40,39,0
1,50,6,9,1,4,0,4,1,0,0,13,39,0
2,38,4,11,0,6,1,4,1,0,0,40,39,0
3,53,4,1,1,6,0,2,1,0,0,40,39,0
4,28,4,9,1,10,5,2,0,0,0,40,5,0

In [84]:
## Verify

for i, name in enumerate(col_cat):
    print(f'{name}: \n {df[name].value_counts(dropna=False)} \n ')

workclass:
 4    22696
6     2541
2     2093
0     1836
7     1298
5     1116
1      960
8       14
3        7
Name: workclass, dtype: int64

education:
 11    10501
15     7291
9      5355
12     1723
8      1382
1      1175
7      1067
0       933
5       646
14      576
6       514
2       433
10      413
4       333
3       168
13       51
Name: education, dtype: int64

marital-status:
 1    15417
2    12701
0     4443
Name: marital-status, dtype: int64

occupation:
 10    4140
3     4099
4     4066
1     3770
12    3650
8     3295
7     2002
0     1843
14    1597
6     1370
5      994
13     928
11     649
9      149
2        9
Name: occupation, dtype: int64

relationship:
 0    13193
1     8305
3     5068
4     3446
5     1568
2      981
Name: relationship, dtype: int64

race:
 4    27816
2     3124
1     1039
0      311
3      271
Name: race, dtype: int64

gender:
 1    21790
0    10771
Name: gender, dtype: int64

native-country:
 39    29170
26      643
0       583
30      198
11      137
2       121
33      114
8       106
19      100
5        95
9        90
23       81
35       80
3        75
22       73
6        70
40       67
13       64
24       62
31       60
4        59
36       51
14       44
20       43
32       37
27       34
29       31
12       29
10       29
7        28
21       24
17       20
1        19
38       19
37       18
25       18
41       16
28       14
18       13
16       13
34       12
15        1
Name: native-country, dtype: int64

income:
 0    24720
1     7841
Name: income, dtype: int64

In [85]:
df.shape

(32561, 13)

In [86]:
### saving data

df_clean= df.copy()

In [87]:
df_clean.to_csv('Adult_cleaned_data.csv', index=False)

#### Model selections
* Decision Tree
* Random Forest

In [115]:
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
import joblib

* Decision Tree

In [94]:
## dependent and target
X= df.iloc[:,:-1].values

y= df.iloc[:,-1].values

In [95]:
X

array([[39,  7,  9, ...,  0, 40, 39],
       [50,  6,  9, ...,  0, 13, 39],
       [38,  4, 11, ...,  0, 40, 39],
       ...,
       [58,  4, 11, ...,  0, 40, 39],
       [22,  4, 11, ...,  0, 20, 39],
       [52,  5, 11, ...,  0, 40, 39]], dtype=int64)

In [96]:
y

array([0, 0, 0, ..., 0, 0, 1])

In [97]:
## split the data

X_train_dt, X_test_dt, y_train_dt, y_test_dt = train_test_split( X, y, test_size=0.30, random_state=42)

In [98]:
print(X_train_dt.shape)
print(y_train_dt.shape)
print(X_test_dt.shape)
print(y_test_dt.shape)

(22792, 12)
(22792,)
(9769, 12)
(9769,)

In [99]:
#Instantiate

dt_clf_gini= DecisionTreeClassifier(criterion='gini',
                                   random_state=100,
                                    max_depth=5,
                                    min_samples_leaf=5
                                   )

In [100]:
## Fit model
dt_clf_gini.fit(X_train_dt, y_train_dt)

DecisionTreeClassifier(max_depth=5, min_samples_leaf=5, random_state=100)

In [103]:
## Predict

y_pred_gini= dt_clf_gini.predict(X_test_dt)

In [108]:
## Evaluation
print(f'Decision tree with Gini accuracy is {accuracy_score(y_pred_gini, y_test_dt)*100}')

Decision tree with Gini accuracy is 83.3452758726584

In [116]:
## Saved model prediction

joblib.dump(dt_clf_gini, 'DecitionTree_Model.pkl')

['DecitionTree_Model.pkl']

* Random Forest

In [109]:
## splitting data


X_train_rf, X_test_rf, y_train_rf, y_test_rf = train_test_split( X, y, test_size=0.30, random_state=42)

In [110]:
print(X_train_rf.shape)
print(y_train_rf.shape)
print(X_test_rf.shape)
print(y_test_rf.shape)

(22792, 12)
(22792,)
(9769, 12)
(9769,)

In [111]:
## Instantiate

rf_clf = RandomForestClassifier(n_estimators=50, random_state=100)

In [112]:
## fit model

rf_clf.fit(X_train_rf, y_train_rf)

RandomForestClassifier(n_estimators=50, random_state=100)

In [113]:
## Predict

y_pred_rf= rf_clf.predict(X_test_rf)

In [114]:
## Evaluation
print(f'Random forest accuracy is {accuracy_score(y_pred_rf, y_test_rf)*100}')

Random forest accuracy is 84.80908997850342

In [117]:
## Saved model prediction

joblib.dump(rf_clf, 'RandomForest_Model.pkl')

['RandomForest_Model.pkl']

Best model is Random Forest

### Flask

Will be develop in pycharm